Bwooce/tinygs_nRF52/src/main.cpp
/* -------------------------------------------------------------------------- */
/* Application State Machine                                                  */
/* -------------------------------------------------------------------------- */

enum app_state {
    STATE_WAIT_THREAD,
    STATE_DNS_RESOLVE,
    STATE_MQTT_CONNECT,
    STATE_MQTT_CONNECTED,
    STATE_ERROR,
};

enum app_state app_state = STATE_WAIT_THREAD;
volatile bool thread_attached = false;

/* -------------------------------------------------------------------------- */
/* MQTT Configuration                                                         */
/* -------------------------------------------------------------------------- */

#define MQTT_BROKER_HOSTNAME "mqtt.tinygs.com"
#define MQTT_BROKER_PORT     8883
#include "mqtt_credentials.h" /* MQTT_USERNAME, MQTT_PASSWORD defaults — gitignored */
#include "tinygs_ca_cert.h"   /* TinyGS server cert for TLS cipher suite config */
#define MQTT_TLS_SEC_TAG     1

/* Runtime config variables are in tinygs_config.cpp, declared in tinygs_config.h */

/* MQTT client and buffers */
static struct mqtt_client mqtt_client;
static uint8_t mqtt_rx_buf[256];  /* Streaming read: headers + topic of incoming PUBLISH */
static uint8_t mqtt_tx_buf[128];  /* MQTT framing only: header+topic; payload sent via iovec */
static struct sockaddr_storage broker_addr;

/* -------------------------------------------------------------------------- */
/* Hardware: Vext, SPI, LoRa pins                                             */
/* -------------------------------------------------------------------------- */

static const struct gpio_dt_spec vext_pwr = GPIO_DT_SPEC_GET(DT_ALIAS(vext), gpios);

static const struct spi_dt_spec lora_spi = SPI_DT_SPEC_GET(DT_NODELABEL(sx1262), SPI_WORD_SET(8) | SPI_TRANSFER_MSB, 0);
static const struct gpio_dt_spec lora_cs = GPIO_DT_SPEC_GET_BY_IDX(DT_PARENT(DT_NODELABEL(sx1262)), cs_gpios, 0);
static const struct gpio_dt_spec lora_reset = GPIO_DT_SPEC_GET(DT_NODELABEL(sx1262), reset_gpios);
static const struct gpio_dt_spec lora_busy = GPIO_DT_SPEC_GET(DT_NODELABEL(sx1262), busy_gpios);
static const struct gpio_dt_spec lora_dio1 = GPIO_DT_SPEC_GET(DT_NODELABEL(sx1262), dio1_gpios);

static void enable_peripherals(void)
{
    if (device_is_ready(vext_pwr.port)) {
        gpio_pin_configure_dt(&vext_pwr, GPIO_OUTPUT_ACTIVE);
        gpio_pin_set_dt(&vext_pwr, 1);
        k_msleep(500);
        LOG_INF("Vext power enabled");
    }
}

/* -------------------------------------------------------------------------- */
/* Hardware Watchdog                                                            */
/* -------------------------------------------------------------------------- */

static const struct device *wdt_dev = DEVICE_DT_GET(DT_NODELABEL(wdt0));
static int wdt_channel_id = -1;

static void watchdog_init(void)
{
    if (!device_is_ready(wdt_dev)) {
        LOG_WRN("Watchdog not available");
        return;
    }

    struct wdt_timeout_cfg cfg = {
        .window = {
            .min = 0,
            .max = CONFIG_MQTT_KEEPALIVE * 2 * 1000, /* 2x keepalive in ms */
        },
        .callback = NULL, /* reset on timeout */
        .flags = WDT_FLAG_RESET_SOC,
    };

    wdt_channel_id = wdt_install_timeout(wdt_dev, &cfg);
    if (wdt_channel_id < 0) {
        LOG_ERR("Watchdog install failed: %d", wdt_channel_id);
        return;
    }

    int ret = wdt_setup(wdt_dev, WDT_OPT_PAUSE_HALTED_BY_DBG);
    if (ret < 0) {
        LOG_ERR("Watchdog setup failed: %d", ret);
        return;
    }

    LOG_INF("Watchdog: %ds timeout (2x keepalive)", CONFIG_MQTT_KEEPALIVE * 2);
}

static void watchdog_feed(void)
{
    if (wdt_channel_id >= 0) {
        wdt_feed(wdt_dev, wdt_channel_id);
    }
}

/* -------------------------------------------------------------------------- */
/* Status LED (green, P1.03, active low)                                       */
/* -------------------------------------------------------------------------- */

static const struct gpio_dt_spec status_led = GPIO_DT_SPEC_GET(DT_ALIAS(led0), gpios);

#if defined(CONFIG_LED_STRIP)
static const struct device *led_strip = DEVICE_DT_GET_OR_NULL(DT_ALIAS(led_strip));
static struct led_rgb leds[2] = {{0}, {0}};
#else
static const void *led_strip = NULL;
#endif

static void led_init(void)
{
    /* Don't configure P1.03 as GPIO — PWM0 will own this pin for breathing LED.
     * The GPIO config would conflict with the PWM peripheral. */
#if defined(CONFIG_LED_STRIP)
    if (led_strip && device_is_ready(led_strip)) {
        /* Clear NeoPixels immediately — bootloader may have left them lit */
        struct led_rgb off[2] = {{0}, {0}};
        led_strip_update_rgb(led_strip, off, 2);
        LOG_INF("NeoPixel: 2x SK6812/WS2812 cleared");
    } else {
        led_strip = NULL;
    }
#endif
}

/* -------------------------------------------------------------------------- */
/* Breathing LED — nRF PWM hardware sequence, zero CPU                         */
/* -------------------------------------------------------------------------- */

#include <nrfx_pwm.h>
#include <nrfx_glue.h>   /* nrfx_isr — required for runtime IRQ binding */
#include <hal/nrf_gpio.h>

static nrfx_pwm_t pwm_led = NRFX_PWM_INSTANCE(0);
static bool pwm_breathing = false;

/* Breathing LED: one gentle pulse, then 25s off, repeat.
 * Uses PWM event handler + k_timer for the pause (end_delay doesn't
 * work with NRFX_PWM_FLAG_LOOP). */
#define BREATH_MAX_DUTY  50    /* 5% max brightness */
#define BREATH_STEPS     64
#define BREATH_PAUSE_S   25    /* Seconds between pulses */
static nrf_pwm_values_individual_t breath_values[BREATH_STEPS];
static nrf_pwm_sequence_t breath_seq = {
    .values = { .p_individual = breath_values },
    .length = NRF_PWM_VALUES_LENGTH(breath_values),
    .repeats = 40,    /* Hold each step ~40ms. Pulse duration: 64*40ms ≈ 2.6s */
    .end_delay = 0,
};

static void breath_timer_handler(struct k_timer *timer);
static K_TIMER_DEFINE(breath_timer, breath_timer_handler, NULL);

