Bwooce/tinygs_nRF52/src/main.cpp
static void breath_pwm_handler(nrfx_pwm_evt_type_t event_type, void *p_context)
{
    if (event_type == NRFX_PWM_EVT_FINISHED) {
        /* Pulse complete — start timer for the pause */
        k_timer_start(&breath_timer, K_SECONDS(BREATH_PAUSE_S), K_NO_WAIT);
    }
}

static void breath_timer_handler(struct k_timer *timer)
{
    /* Pause complete — play one more pulse */
    if (pwm_breathing) {
        nrfx_pwm_simple_playback(&pwm_led, &breath_seq, 1, 0);
    }
}

static void breathing_led_init(void)
{
    /* Build breathing table. pin_inverted handles active-low LED,
     * so 0=off, BREATH_MAX_DUTY=max brightness. */
    for (int i = 0; i < BREATH_STEPS; i++) {
        int brightness = (i < 32) ? i : (63 - i);
        int duty = brightness * brightness * BREATH_MAX_DUTY / (31 * 31);
        breath_values[i].channel_0 = (uint16_t)duty;
        breath_values[i].channel_1 = 0;
        breath_values[i].channel_2 = 0;
        breath_values[i].channel_3 = 0;
    }

    nrfx_pwm_config_t config = {
        .output_pins = {
            NRF_GPIO_PIN_MAP(1, 3),  /* P1.03 = green LED */
            NRF_PWM_PIN_NOT_CONNECTED,
            NRF_PWM_PIN_NOT_CONNECTED,
            NRF_PWM_PIN_NOT_CONNECTED,
        },
        .pin_inverted = { true, false, false, false }, /* Active LOW LED */
        .irq_priority = NRFX_PWM_DEFAULT_CONFIG_IRQ_PRIORITY,
        .base_clock   = NRF_PWM_CLK_1MHz,
        .count_mode   = NRF_PWM_MODE_UP,
        .top_value    = 1000,
        .load_mode    = NRF_PWM_LOAD_INDIVIDUAL,
        .step_mode    = NRF_PWM_STEP_AUTO,
    };

    /* Hook PWM0 IRQ vector to the nrfx dispatcher. Zephyr's nrfx
     * integration doesn't auto-connect when we use nrfx_pwm directly,
     * so the IRQ fires into a NULL vector → K_ERR_SPURIOUS_IRQ.
     * IRQ_CONNECT doesn't build in C++, so register dynamically.
     * Requires CONFIG_DYNAMIC_INTERRUPTS=y.
     *
     * Use `nrfx_isr` as the ISR trampoline with the nrfx handler passed
     * as context — this is Zephyr's canonical pattern (see
     * ncs/zephyr/modules/hal_nordic/nrfx/nrfx_glue.c). The previous
     * direct-cast form only worked by accident of ARM calling
     * convention (unused R0 arg) and would be fragile across nrfx
     * versions. Priority matches nrfx's own default so the LED IRQ
     * doesn't preempt higher-priority nrfx peripherals. */
    irq_connect_dynamic(PWM0_IRQn,
                        NRFX_PWM_DEFAULT_CONFIG_IRQ_PRIORITY,
                        nrfx_isr,
                        (const void *)nrfx_pwm_0_irq_handler,
                        0);
    irq_enable(PWM0_IRQn);
    if (nrfx_pwm_init(&pwm_led, &config, breath_pwm_handler, NULL) == NRFX_SUCCESS) {
        /* Play a single-step "off" sequence to ensure LED starts dark.
         * Without this, the PWM idle state may leave the pin floating. */
        static nrf_pwm_values_individual_t off_val = { 0, 0, 0, 0 };
        static nrf_pwm_sequence_t off_seq = {
            .values = { .p_individual = &off_val },
            .length = NRF_PWM_VALUES_LENGTH(off_val),
            .repeats = 0,
            .end_delay = 0,
        };
        nrfx_pwm_simple_playback(&pwm_led, &off_seq, 1, 0);
        LOG_INF("Breathing LED: PWM0 on P1.03");
    }
}

static void breathing_led_start(void)
{
    if (!pwm_breathing) {
        pwm_breathing = true;
        nrfx_pwm_simple_playback(&pwm_led, &breath_seq, 1, 0); /* play once, handler restarts */
    }
}

static void breathing_led_stop(void)
{
    if (pwm_breathing) {
        pwm_breathing = false;
        k_timer_stop(&breath_timer);
        nrfx_pwm_stop(&pwm_led, false);
        /* PWM released — manually drive pin to turn LED off.
         * Active-low LED: HIGH = off */
        nrf_gpio_cfg_output(NRF_GPIO_PIN_MAP(1, 3));
        nrf_gpio_pin_set(NRF_GPIO_PIN_MAP(1, 3));
    }
}

static void led_set(bool on)
{
    /* P1.03 is now PWM-driven (breathing LED). Use breathing_led_start/stop instead.
     * This function kept for error state where we want solid on/off. */
    (void)on;
}

/* NeoPixel colors — LED0=status (problems only), LED1=activity */
#define NEO_OFF       0, 0, 0
#define NEO_RED       20, 0, 0
#define NEO_GREEN     0, 10, 0
#define NEO_BLUE      0, 0, 20
#define NEO_YELLOW    15, 10, 0
#define NEO_WHITE     30, 30, 30

/* NeoPixel functions — no-ops when LED_STRIP is disabled */
static void neopixel_set(uint8_t r0, uint8_t g0, uint8_t b0,
                          uint8_t r1, uint8_t g1, uint8_t b1)
{
#if defined(CONFIG_LED_STRIP)
    if (!led_strip) return;
    leds[0].r = r0; leds[0].g = g0; leds[0].b = b0;
    leds[1].r = r1; leds[1].g = g1; leds[1].b = b1;
    led_strip_update_rgb(led_strip, leds, 2);
#endif
    (void)r0; (void)g0; (void)b0; (void)r1; (void)g1; (void)b1;
}

static void neopixel_off(void)
{
    neopixel_set(0, 0, 0, 0, 0, 0);
}

/* -------------------------------------------------------------------------- */
/* Battery Voltage ADC                                                         */
/* -------------------------------------------------------------------------- */

/* Battery ADC: P0.04 (AIN2), bias enable from DTS alias.
 * Voltage divider 100k:390k → multiplier ~4.9 */
static const struct gpio_dt_spec adc_ctrl = GPIO_DT_SPEC_GET(DT_ALIAS(adc_ctrl), gpios);

int read_vbat_mv(void)
{
    const struct device *adc_dev = DEVICE_DT_GET(DT_NODELABEL(adc));
    if (!device_is_ready(adc_dev)) {
        return 3700;
    }

    /* Enable the voltage divider bias circuit */
    if (device_is_ready(adc_ctrl.port)) {
        gpio_pin_configure_dt(&adc_ctrl, GPIO_OUTPUT_ACTIVE);
        gpio_pin_set_dt(&adc_ctrl, 1);
        k_msleep(2);
    }

    struct adc_channel_cfg ch_cfg = {
        .gain = ADC_GAIN_1_6,
        .reference = ADC_REF_INTERNAL,
        .acquisition_time = ADC_ACQ_TIME_DEFAULT,
        .channel_id = 2,
        .input_positive = NRF_SAADC_AIN2,
    };
    adc_channel_setup(adc_dev, &ch_cfg);

    int16_t sample = 0;
    struct adc_sequence seq = {
        .channels = BIT(2),
        .buffer = &sample,
        .buffer_size = sizeof(sample),
        .resolution = 12,
    };

    int ret = adc_read(adc_dev, &seq);

    /* Disable bias to save power */
    if (device_is_ready(adc_ctrl.port)) {
        gpio_pin_set_dt(&adc_ctrl, 0);
    }

    if (ret != 0 || sample < 0) {
        LOG_WRN("ADC read failed: %d (sample=%d)", ret, sample);
        return 3700;
    }

    /* raw * (3600mV / 4096) * 4.9 */
    return (int)((float)sample * 3600.0f / 4096.0f * 4.9f);
}

