Bwooce/tinygs_nRF52/src/main.cpp
        if (err != OT_ERROR_NONE) {
            LOG_ERR("otJoinerStart failed: %d (%s)", (int)err, otThreadErrorToString(err));
        } else {
            LOG_INF("Joiner started, waiting for commissioner (PSKd: %s)...",
                    CONFIG_OPENTHREAD_JOINER_PSKD);
        }
    }

    dump_ot_state(ctx);
    openthread_api_mutex_unlock(ctx);
}

/* Build a NAT64-synthesised IPv6 peer from the mesh's favored NAT64
 * prefix (read live from Thread netdata) and a caller-supplied IPv4
 * literal. Returns true and fills *out on success; false if no NAT64
 * route is present. Used by both the DNS and SNTP sync paths to avoid
 * ULA→global egress, which OT BorderRouting ICMP-rejects. */
static bool nat64_synth(otInstance *instance, const uint8_t ipv4[4],
                        otIp6Address *out)
{
    otNetworkDataIterator it = OT_NETWORK_DATA_ITERATOR_INIT;
    otExternalRouteConfig route;
    while (otNetDataGetNextRoute(instance, &it, &route) == OT_ERROR_NONE) {
        if (route.mNat64 && route.mPrefix.mLength == 96) {
            *out = route.mPrefix.mPrefix;
            memcpy(&out->mFields.m8[12], ipv4, 4);
            return true;
        }
    }
    return false;
}

/* -------------------------------------------------------------------------- */
/* DNS Resolution via OpenThread DNS client (NAT64)                            */
/* -------------------------------------------------------------------------- */

static K_SEM_DEFINE(dns_sem, 0, 1);
static volatile int dns_result = -1;

/* Shared resolver-callback context: the callback writes the resolved
 * IPv6 address into *out. Hostname is carried for logging only. Port
 * stamping is left to the caller since different callers want different
 * sockaddr / otMessageInfo types. */
struct dns_ctx {
    otIp6Address *out;
    const char  *hostname;
};

static void dns_callback(otError aError, const otDnsAddressResponse *aResponse, void *aContext)
{
    struct dns_ctx *ctx = (struct dns_ctx *)aContext;
    if (aError != OT_ERROR_NONE) {
        LOG_ERR("OT DNS callback error: %d (%s)", (int)aError, otThreadErrorToString(aError));
        dns_result = -1;
        k_sem_give(&dns_sem);
        return;
    }

    otIp6Address addr;
    uint32_t ttl;
    otError err = otDnsAddressResponseGetAddress(aResponse, 0, &addr, &ttl);
    if (err != OT_ERROR_NONE) {
        LOG_ERR("OT DNS no address in response: %d (%s)", (int)err, otThreadErrorToString(err));
        dns_result = -1;
        k_sem_give(&dns_sem);
        return;
    }

    if (ctx && ctx->out) {
        *ctx->out = addr;
    }

    char addr_str[OT_IP6_ADDRESS_STRING_SIZE];
    otIp6AddressToString(&addr, addr_str, sizeof(addr_str));
    LOG_INF("Resolved %s -> [%s] (TTL=%u)",
            ctx && ctx->hostname ? ctx->hostname : "?", addr_str, (unsigned)ttl);

    dns_result = 0;
    k_sem_give(&dns_sem);
}

/* Generic hostname → NAT64-synthesised IPv6 resolver. Used by the MQTT
 * broker and SNTP paths — anywhere we need to reach an IPv4-only host
 * from the Thread mesh. Returns 0 on success and fills *out; -1 on any
 * failure. Blocks up to 15 s waiting on the DNS callback. */
static int resolve_ipv4_hostname(const char *hostname, otIp6Address *out)
{
    struct openthread_context *ctx = openthread_get_default_context();

    k_sem_reset(&dns_sem);
    dns_result = -1;

    otDnsQueryConfig config;
    memset(&config, 0, sizeof(config));
    static const uint8_t dns_v4[4] = TINYGS_DNS_SERVER_V4;
    openthread_api_mutex_lock(ctx);
    bool found = nat64_synth(ctx->instance, dns_v4, &config.mServerSockAddr.mAddress);
    openthread_api_mutex_unlock(ctx);
    if (!found) {
        LOG_ERR("No /96 NAT64 route in Thread netdata — mesh has no NAT64 translator?");
        return -1;
    }
    config.mServerSockAddr.mPort    = TINYGS_DNS_SERVER_PORT;
    config.mResponseTimeout         = 10000;
    config.mMaxTxAttempts           = 3;
    config.mRecursionFlag           = OT_DNS_FLAG_RECURSION_DESIRED;
    config.mNat64Mode               = OT_DNS_NAT64_ALLOW;

    char dns_str[OT_IP6_ADDRESS_STRING_SIZE];
    otIp6AddressToString(&config.mServerSockAddr.mAddress, dns_str, sizeof(dns_str));
    LOG_INF("Resolving %s via NAT64-synthesised DNS [%s]:53",
            hostname, dns_str);

    struct dns_ctx dctx = { .out = out, .hostname = hostname };

    /* Query A record (IPv4) explicitly. IPv4-only hosts return NotFound
     * for AAAA queries. With mNat64Mode=ALLOW and a NAT64 prefix in
     * netdata, OT synthesises an AAAA from the A response — we get back
     * a NAT64-prefixed address directly usable as a peer. */
    openthread_api_mutex_lock(ctx);
    otError err = otDnsClientResolveIp4Address(ctx->instance,
                                               hostname,
                                               dns_callback, &dctx,
                                               &config);
    openthread_api_mutex_unlock(ctx);

    if (err != OT_ERROR_NONE) {
        LOG_ERR("otDnsClientResolveAddress failed: %d (%s)",
                (int)err, otThreadErrorToString(err));
        return -1;
    }

    /* Wait for callback (up to 15s) */
    if (k_sem_take(&dns_sem, K_SECONDS(15)) != 0) {
        LOG_ERR("DNS resolution timed out");
        return -1;
    }

    return dns_result;
}

/* Resolve the MQTT broker hostname and stamp it into broker_addr. Thin
 * wrapper over resolve_ipv4_hostname() — keeps the state-machine
 * caller simple. */
static int resolve_broker(void)
{
    otIp6Address addr;
    int rc = resolve_ipv4_hostname(MQTT_BROKER_HOSTNAME, &addr);
    if (rc != 0) {
        return rc;
    }
    struct sockaddr_in6 *sin6 = (struct sockaddr_in6 *)&broker_addr;
    memset(sin6, 0, sizeof(*sin6));
    sin6->sin6_family = AF_INET6;
    sin6->sin6_port = htons(MQTT_BROKER_PORT);
    memcpy(&sin6->sin6_addr, &addr, sizeof(addr));
    return 0;
}

/* -------------------------------------------------------------------------- */
/* MQTT Event Handler                                                          */
/* -------------------------------------------------------------------------- */

static uint32_t mqtt_connected_uptime_ms = 0;
static uint32_t mqtt_rx_count = 0;  /* MQTT messages received */
static uint32_t lora_rx_count = 0;  /* LoRa packets received */
static bool mqtt_first_connect = true; /* Clean session only on first connect */
static uint32_t doppler_interval_ms = 4000; /* Updated by foff [offset, tol, refresh] */
static uint32_t mqtt_last_pingresp_ms = 0;

