Bwooce/tinygs_nRF52/src/main.cpp
                        if (msg.sat) {
                            strncpy(tinygs_radio.satellite, msg.sat,
                                    sizeof(tinygs_radio.satellite) - 1);
                            tinygs_radio.satellite[sizeof(tinygs_radio.satellite) - 1] = '\0';
                        }
                        tinygs_radio.norad = (uint32_t)msg.NORAD;

                        bool is_fsk = msg.mode && strcmp(msg.mode, "LoRa") != 0;
                        strncpy(tinygs_radio.modem_mode,
                                is_fsk ? "FSK" : "LoRa",
                                sizeof(tinygs_radio.modem_mode) - 1);

                        if (!is_fsk) {
                            /* ---- LoRa mode ---- */
                            radio->setFrequency(freq + tinygs_radio.freq_offset / 1e6f);
                            float bw = tinygs_begine_get_bw(&msg);
                            if (bw > 0.0f) {
                                radio->setBandwidth(bw);
                                tinygs_radio.bw = bw;
                            }
                            if (msg.sf >= 5 && msg.sf <= 12) {
                                radio->setSpreadingFactor(msg.sf);
                                tinygs_radio.sf = msg.sf;
                            }
                            if (msg.cr >= 4 && msg.cr <= 8) {
                                radio->setCodingRate(msg.cr);
                                tinygs_radio.cr = msg.cr;
                            }
                            radio->setSyncWord(msg.sw);
                            radio->setPreambleLength(msg.pl);
                            tinygs_radio.pl = msg.pl;
                            tinygs_radio.crc_on = msg.crc;
                            tinygs_radio.fldro = msg.fldro;

                            if (msg.fldro == 2) {
                                radio->autoLDRO();
                            } else {
                                radio->forceLDRO(msg.fldro ? true : false);
                            }

                            radio->setCRC(msg.crc ? 2 : 0);
                            radio->invertIQ(msg.iIQ);
                            tinygs_radio.iIQ = msg.iIQ;

                            /* Implicit vs explicit header: ESP32 uses "len" field,
                             * NOT "cl". "cl" is content length for display.
                             * "len" defaults to 0 = explicit header. */
                            if (msg.len > 0) {
                                radio->implicitHeader(msg.len);
                            } else {
                                radio->explicitHeader();
                            }

                            radio->setRxBoostedGainMode(true);
                        } else {
                            /* ---- FSK mode ---- */
                            float bw = tinygs_begine_get_bw(&msg);
                            float fd = tinygs_begine_get_fd(&msg);
                            float br = tinygs_begine_get_br(&msg);
                            tinygs_radio.bw = bw;
                            tinygs_radio.bitrate = br;
                            tinygs_radio.freq_dev = fd;
                            tinygs_radio.ook = msg.ook;
                            tinygs_radio.fsk_len = msg.len;

                            /* Server's "br" and "fd" are already in kbps and
                             * kHz respectively (ESP32 station hands them to
                             * RadioLib unscaled). Don't divide. */
                            /* TODO(debug): verbose log — confirms -707 / unit
                             * regressions if they recur. Keep while we're
                             * still hitting new FSK sat configs for the
                             * first time. Remove once we've seen a week
                             * of clean FSK inits and a real RX. */
                            LOG_INF("  beginFSK args: freq=%.4f br=%.3f fd=%.3f bw=%.1f pwr=%d pl=%d tcxo=%.1f",
                                    (double)(freq + tinygs_radio.freq_offset / 1e6f),
                                    (double)br, (double)fd, (double)bw,
                                    msg.pwr, msg.pl, (double)LORA_TCXO_VOLTAGE);
                            int16_t rc = radio->beginFSK(
                                freq + tinygs_radio.freq_offset / 1e6f,
                                br,                      /* kbps */
                                fd,                      /* kHz */
                                bw,                      /* kHz */
                                msg.pwr,
                                msg.pl,
                                LORA_TCXO_VOLTAGE);
                            if (rc != RADIOLIB_ERR_NONE) {
                                LOG_ERR("beginFSK failed: %d (%s)", rc, radio_err_name(rc));
                            }

                            /* Re-register DIO1 interrupt (beginFSK resets it) */
                            radio->setPacketReceivedAction(lora_rx_callback);

                            radio->setCRC(0); /* FSK HW CRC off — done in software */

                            if (msg.len > 0) {
                                radio->fixedPacketLengthMode(msg.len);
                            }

                            /* FSK sync word from "fsw" array in JSON */
                            uint8_t fsw_buf[8];
                            int fsw_len = tinygs_parse_fsw(
                                tinygs_radio.modem_conf,
                                strlen(tinygs_radio.modem_conf),
                                fsw_buf, sizeof(fsw_buf));
                            if (fsw_len > 0) {
                                radio->setSyncWord(fsw_buf, fsw_len);
                            }

                            /* OOK / data shaping */
                            if (msg.ook == 255) {
                                radio->setDataShaping(RADIOLIB_SHAPING_1_0);
                            } else if (msg.ook > 0) {
                                radio->setDataShaping((float)msg.ook);
                            } else {
                                radio->setDataShaping(RADIOLIB_SHAPING_NONE);
                            }

                            /* Encoding: 0=NRZ, 1=Manchester, 2=whitening */
                            radio->setEncoding(msg.enc);
                            if (msg.enc == 2) {
                                radio->setWhitening(true, msg.ws);
                            }
                            tinygs_radio.fsk_enc = msg.enc;
                            tinygs_radio.fsk_framing = msg.fr;

                            /* Software CRC config — stored for post-RX check */
                            tinygs_radio.sw_crc_enabled = msg.cSw;
                            tinygs_radio.sw_crc_bytes = (uint8_t)msg.cB;
                            tinygs_radio.sw_crc_init = (uint16_t)msg.cI;
                            tinygs_radio.sw_crc_poly = (uint16_t)msg.cP;
                            tinygs_radio.sw_crc_xor = (uint16_t)msg.cF;
                            tinygs_radio.sw_crc_refin = msg.cRI;
                            tinygs_radio.sw_crc_refout = msg.cRO;

