Bwooce/tinygs_nRF52/src/main.cpp
                            radio->setRxBoostedGainMode(true);
                        }
                    }

                    /* Parse filter (array — not handled by json.h descriptors) */
                    int filt_count = tinygs_parse_filter(
                        tinygs_radio.modem_conf, strlen(tinygs_radio.modem_conf),
                        tinygs_radio.filter, sizeof(tinygs_radio.filter));
                    tinygs_radio.filter_len = (filt_count > 0) ? filt_count : 0;
                    if (filt_count <= 0) tinygs_radio.filter[0] = 0;

                    /* Parse TLE base64 from modem_conf copy.
                     * "tle" key = active Doppler compensation
                     * "tlx" key = passive TLE (position display only, no Doppler) */
                    const char *tle_p = strstr(tinygs_radio.modem_conf, "\"tle\":\"");
                    const char *tlx_p = strstr(tinygs_radio.modem_conf, "\"tlx\":\"");
                    const char *tle_key = tle_p ? tle_p : tlx_p;
                    bool active_doppler = (tle_p != NULL);

                    if (tle_key) {
                        const char *b64_start = tle_key + 7; /* skip "tle":"  or "tlx":" (7 chars) */
                        const char *b64_end = strchr(b64_start, '"');
                        if (b64_end) {
                            size_t decoded_len = 0;
                            if (base64_decode((uint8_t *)tinygs_radio.tle,
                                              sizeof(tinygs_radio.tle),
                                              &decoded_len,
                                              (const uint8_t *)b64_start,
                                              b64_end - b64_start) == 0
                                && decoded_len >= 34
                                && decoded_len <= sizeof(tinygs_radio.tle)) {
                                tinygs_radio.tle_valid = true;
                                tinygs_radio.doppler_enabled = active_doppler;
                                tinygs_radio.freq_doppler = 0.0f;
                                LOG_INF("  TLE received (%zu bytes)%s",
                                        decoded_len, active_doppler ? " +Doppler" : "");
                            } else {
                                tinygs_radio.tle_valid = false;
                            }
                        }
                    } else {
                        tinygs_radio.tle_valid = false;
                        tinygs_radio.doppler_enabled = false;
                    }

                    /* Re-enable RX interrupt and start receiving */
                    radio->setPacketReceivedAction(lora_rx_callback);
                    radio->startReceive();

                    /* tle_tag: "TLE" = active Doppler (server sent "tle" key),
                     *          "TLX" = passive map data only (server sent "tlx"),
                     *          ""    = no orbit data at all. */
                    const char *tle_tag = tinygs_radio.tle_valid
                        ? (tinygs_radio.doppler_enabled ? " TLE" : " TLX")
                        : "";
                    if (strcmp(tinygs_radio.modem_mode, "FSK") == 0) {
                        LOG_INF("  → %s %.4fMHz FSK BR%.0f BW%.1f%s%s",
                                tinygs_radio.satellite,
                                (double)tinygs_radio.frequency,
                                (double)tinygs_radio.bitrate,
                                (double)tinygs_radio.bw,
                                tle_tag,
                                tinygs_radio.filter[0] ? " FLT" : "");
                    } else {
                        LOG_INF("  → %s %.4fMHz SF%d BW%.1f%s%s",
                                tinygs_radio.satellite,
                                (double)tinygs_radio.frequency,
                                tinygs_radio.sf,
                                (double)tinygs_radio.bw,
                                tle_tag,
                                tinygs_radio.filter[0] ? " FLT" : "");
                    }
                }
            } else if (strcmp(cmnd, "begin_lora") == 0) {
                /* Legacy array format: [freq,bw,sf,cr,sw,pwr,climit,pl,gain] */
                if (radio) {
                    radio->clearPacketReceivedAction();
                    if (lora_packet_received) lora_packet_received = false;
                    float vals[9] = {0};
                    const char *p = strchr((char *)rx_payload, '[');
                    if (p) {
                        p++;
                        for (int i = 0; i < 9 && *p && *p != ']'; i++) {
                            vals[i] = strtof(p, (char **)&p);
                            while (*p == ',' || *p == ' ') p++;
                        }
                        float freq = vals[0];
                        if (freq > 100.0f && freq < 1000.0f) {
                            tinygs_radio.frequency = freq;
                            radio->setFrequency(freq + tinygs_radio.freq_offset / 1e6f);
                            radio->setBandwidth(vals[1]); tinygs_radio.bw = vals[1];
                            radio->setSpreadingFactor((int)vals[2]); tinygs_radio.sf = (int)vals[2];
                            radio->setCodingRate((int)vals[3]); tinygs_radio.cr = (int)vals[3];
                            radio->setSyncWord((int)vals[4]);
                            radio->setPreambleLength((int)vals[7]);
                            radio->setRxBoostedGainMode(true);
                            strncpy(tinygs_radio.modem_mode, "LoRa", sizeof(tinygs_radio.modem_mode));
                            radio->setPacketReceivedAction(lora_rx_callback);
                            radio->startReceive();
                            LOG_INF("  begin_lora: %.4fMHz SF%d BW%.1f",
                                    (double)freq, (int)vals[2], (double)vals[1]);
                        }
                    }
                }
            } else if (strcmp(cmnd, "begin_fsk") == 0) {
                /* Legacy array format: [freq,br,fd,rxBw,pwr,pl,ook,len] */
                if (radio) {
                    radio->clearPacketReceivedAction();
                    if (lora_packet_received) lora_packet_received = false;
                    float vals[8] = {0};
                    const char *p = strchr((char *)rx_payload, '[');
                    if (p) {
                        p++;
                        for (int i = 0; i < 8 && *p && *p != ']'; i++) {
                            vals[i] = strtof(p, (char **)&p);
                            while (*p == ',' || *p == ' ') p++;
                        }
                        float freq = vals[0];
                        if (freq > 100.0f && freq < 1000.0f) {
                            tinygs_radio.frequency = freq;
                            tinygs_radio.bw = vals[3];
                            tinygs_radio.bitrate = vals[1];
                            tinygs_radio.freq_dev = vals[2];
                            tinygs_radio.ook = (int)vals[6];
                            tinygs_radio.fsk_len = (int)vals[7];
                            strncpy(tinygs_radio.modem_mode, "FSK", sizeof(tinygs_radio.modem_mode));
                            int16_t rc = radio->beginFSK(
                                freq + tinygs_radio.freq_offset / 1e6f,
                                vals[1] / 1000.0f, vals[2] / 1000.0f, vals[3],
                                (int)vals[4], (int)vals[5], LORA_TCXO_VOLTAGE);
                            if (rc == RADIOLIB_ERR_NONE) {
                                radio->setPacketReceivedAction(lora_rx_callback);
                                radio->setCRC(0);
                                if ((int)vals[7] > 0) radio->fixedPacketLengthMode((int)vals[7]);
                                radio->setRxBoostedGainMode(true);
                                radio->startReceive();
                                LOG_INF("  begin_fsk: %.4fMHz BR%.0f FD%.0f",
                                        (double)freq, (double)vals[1], (double)vals[2]);
                            } else {
                                LOG_ERR("  begin_fsk failed: %d (%s)", rc, radio_err_name(rc));
                            }
                        }
                    }
                }
            } else if (strcmp(cmnd, "freq") == 0) {
                /* Direct frequency set (MHz as number) */
                float freq = strtof((char *)rx_payload, NULL);
                if (radio && freq > 100.0f && freq < 1000.0f) {
                    tinygs_radio.frequency = freq;
                    radio->setFrequency(freq + tinygs_radio.freq_offset / 1e6f);
                    radio->startReceive();
                    LOG_INF("  → freq=%.4f MHz (foff=%.0f Hz)",
                            (double)freq, (double)tinygs_radio.freq_offset);
                }
            } else if (strcmp(cmnd, "sat") == 0) {
                /* Select satellite — payload is ["name", NORAD] */
                const char *p = strstr((char *)rx_payload, "\"");
                if (p) {
                    const char *end = strchr(p + 1, '"');
                    if (end && (end - p - 1) < (int)sizeof(tinygs_radio.satellite)) {
                        memcpy(tinygs_radio.satellite, p + 1, end - p - 1);
                        tinygs_radio.satellite[end - p - 1] = '\0';
                        /* Parse NORAD after the closing quote: ,"12345"] */
                        const char *comma = strchr(end, ',');
                        if (comma) {
                            tinygs_radio.norad = (uint32_t)atoi(comma + 1);
                        }
                        LOG_INF("  → satellite: %s NORAD=%u",
                                tinygs_radio.satellite, (unsigned)tinygs_radio.norad);
                    }
                }
            } else if (strcmp(cmnd, "set_pos_prm") == 0) {
                tinygs_handle_set_pos((char *)rx_payload, ret);
            } else if (strcmp(cmnd, "set_name") == 0) {
                extern char device_client_id[13];
                struct tinygs_name_msg name_msg;
                if (tinygs_parse_set_name((char *)rx_payload, ret, &name_msg) == 0) {
                    if (strcmp(name_msg.mac, device_client_id) == 0) {
                        strncpy(cfg_station, name_msg.name, sizeof(cfg_station) - 1);
                        cfg_station[sizeof(cfg_station) - 1] = '\0';
                        tinygs_config_save_station(cfg_station);
                        LOG_INF("  → Renamed to: %s (saved, rebooting)", cfg_station);
                        k_msleep(500);
                        sys_reboot(SYS_REBOOT_COLD);
                    } else {
                        LOG_DBG("  → set_name: MAC mismatch");
                    }
                }
            } else if (strcmp(cmnd, "status") == 0) {
                tinygs_send_status(client, cfg_mqtt_user, cfg_station);
            } else if (strcmp(cmnd, "reset") == 0) {
                LOG_WRN("*** SERVER RESET — rebooting ***");
                mqtt_disconnect(client);
                k_msleep(2000);
                sys_reboot(SYS_REBOOT_COLD);
            } else if (strcmp(cmnd, "tx") == 0) {
                /* TX is gated on cfg_tx_enable. Default off — we advertise
                 * tx:false in welcome and the server then never schedules
                 * this command. Kept only as a hook for operators who set
                 * tx_enable:1 in config.json and have the antenna/licensing
                 * to actually transmit. Returning to RX after TX is best-
                 * effort. */
                if (!cfg_tx_enable) {
                    LOG_WRN("  → TX refused (cfg_tx_enable=0, RX-only station)");
                } else if (radio && ret > 0) {
                    int16_t trc = radio->transmit((const uint8_t *)rx_payload, ret);
                    radio->startReceive();
                    LOG_INF("  → TX %zu bytes, rc=%d", (size_t)ret, trc);
                } else {
                    LOG_WRN("  → TX skipped (no radio or empty payload)");
                }
            } else if (strcmp(cmnd, "log") == 0) {
                LOG_INF("  → Server: %s", (char *)rx_payload);
            } else if (strcmp(cmnd, "sleep") == 0 || strcmp(cmnd, "siesta") == 0) {
                uint32_t secs = tinygs_parse_sleep((char *)rx_payload, ret);
                if (secs == 0) {
                    LOG_WRN("  → %s: invalid payload, ignoring", cmnd);
                } else {
                    LOG_INF("  → %s: %u seconds", cmnd, secs);
                    /* Put radio in sleep first — dominant current draw */
                    if (radio) radio->sleep();
                    /* Disconnect MQTT so the broker drops us cleanly rather
                     * than holding state through a missed keepalive. */
                    mqtt_disconnect(client);
                    k_msleep(200);
                    /* Block the main thread — Zephyr's tick idle handler
                     * lets the CPU enter low-power sleep. OpenThread will
                     * still service MAC frames on its own thread. */
                    k_sleep(K_SECONDS(secs));
                    /* Reboot on wake — cleanest re-init of radio + network
                     * (matches ESP32 deep-sleep-wake-then-reset behaviour). */
                    LOG_INF("  → wake — rebooting");
                    sys_reboot(SYS_REBOOT_COLD);
                }
            } else if (strcmp(cmnd, "foff") == 0) {
                float foff = tinygs_parse_foff((char *)rx_payload, ret,
                                                &tinygs_radio.doppler_tol,
                                                &doppler_interval_ms);
                tinygs_radio.freq_offset = foff;
                if (radio) {
                    radio->setFrequency(tinygs_radio.frequency +
                                        tinygs_radio.freq_offset / 1e6f);
                    radio->startReceive();
                }
                LOG_INF("  → foff=%.0f Hz tol=%.0f Hz refresh=%ums",
                        (double)foff, (double)tinygs_radio.doppler_tol,
                        (unsigned)doppler_interval_ms);
            } else if (strcmp(cmnd, "filter") == 0) {
                int fcount = tinygs_parse_filter((char *)rx_payload, ret,
                                                  tinygs_radio.filter,
                                                  sizeof(tinygs_radio.filter));
                tinygs_radio.filter_len = (fcount > 0) ? fcount : 0;
                LOG_INF("  → filter: %d bytes", tinygs_radio.filter_len);
            } else if (strcmp(cmnd, "update") == 0) {
                /* Server pushes a URL pointing at a new firmware image.
                 * On our hardware there is no network-OTA path: the
                 * Adafruit UF2 bootloader requires a physical USB mass-
                 * storage copy of a .uf2 file. We log the URL so the
                 * operator can fetch and flash it manually. A future
                 * MCUboot-based variant could fetch via CoAP over Thread
                 * and stage into slot1; that's a hardware change, not a
                 * code change in this firmware. */
                if (ret > 0) {
                    /* Payload is not guaranteed NUL-terminated — copy to bounded buf */
                    char url[128];
                    size_t n = ((size_t)ret < sizeof(url) - 1) ? (size_t)ret
                                                              : sizeof(url) - 1;
                    memcpy(url, rx_payload, n);
                    url[n] = '\0';
                    LOG_INF("  → update URL: %s", url);
                    LOG_INF("  → (UF2 bootloader: fetch + drag-and-drop to HT-n5262 to apply)");
                } else {
                    LOG_INF("  → update: (empty payload)");
                }
            } else if (strcmp(cmnd, "weblogin") == 0) {
                LOG_INF("  *** TinyGS Web Login URL: %s", (char *)rx_payload);
                LOG_INF("  *** Open this URL to configure auto-tune and other settings");
            } else if (strcmp(cmnd, "sat_pos_oled") == 0) {
                /* Satellite position for world map: [x, y] in 128x64 pixel coords */
                const char *p = strchr((char *)rx_payload, '[');
                if (p) {
                    p++;
                    tinygs_radio.sat_pos_x = strtof(p, (char **)&p);
                    while (*p == ',' || *p == ' ') p++;
                    tinygs_radio.sat_pos_y = strtof(p, NULL);
                }
                LOG_DBG("  → sat_pos: %.0f,%.0f",
                        (double)tinygs_radio.sat_pos_x,
                        (double)tinygs_radio.sat_pos_y);
            } else if (strncmp(cmnd, "frame/", 6) == 0) {
                int frame_num = atoi(cmnd + 6);
                tinygs_display_set_remote_frame(frame_num,
                                                 (const char *)rx_payload, ret);
                /* Server pushes frame/0 in two stages for every RX'd packet:
                 * first with sat="UNKNOWN", status="UNKNOWN" ("got your bytes,
                 * haven't decoded yet"), then ~10s later sat="<real name>",
                 * status="CONFIRMED" after decode + cross-reference with other
                 * stations. If CONFIRMED never arrives the packet wasn't
                 * decodable. Labeling the stage here makes it easy to spot
                 * non-confirmed packets in the log. */
                const char *stage = strstr((char *)rx_payload, "CONFIRMED")
                                        ? "CONFIRMED"
                                    : strstr((char *)rx_payload, "UNKNOWN")
                                        ? "pending(UNKNOWN)"
                                        : "unlabelled";
                LOG_INF("  → frame/%d stage=%s", frame_num, stage);
            } else if (strcmp(cmnd, "frame") == 0) {
                LOG_DBG("  → frame command without number, ignored");
            } else if (strcmp(cmnd, "set_adv_prm") == 0) {
                /* Server pushes an advanced-params JSON blob. Store it opaquely;
                 * ESP32 parses it into ConfigManager but we have no concrete use
                 * for the fields yet — keep the raw string so get_adv_prm can
                 * echo it back. */
                size_t n = (ret < (int)sizeof(cfg_adv_prm) - 1) ? (size_t)ret
                                                                : sizeof(cfg_adv_prm) - 1;
                memcpy(cfg_adv_prm, rx_payload, n);
                cfg_adv_prm[n] = '\0';
                LOG_INF("  → set_adv_prm stored (%zu bytes)", n);
            } else if (strcmp(cmnd, "get_adv_prm") == 0) {
                /* Server asks us to echo our current adv_prm. Publish to
                 * tele/get_adv_prm (ESP32 uses the same topic for response). */
                tinygs_send_adv_prm(client, cfg_mqtt_user, cfg_station, cfg_adv_prm);
                LOG_INF("  → get_adv_prm responded");
            } else if (strcmp(cmnd, "remoteTune") == 0) {
                /* Newer server command — payload is a single number applied as
                 * an additional freq offset in Hz. */
                float off = strtof((char *)rx_payload, NULL);
                tinygs_radio.freq_offset = off;
                if (radio) {
                    radio->setFrequency(tinygs_radio.frequency +
                                        tinygs_radio.freq_offset / 1e6f);
                    radio->startReceive();
                }
                LOG_INF("  → remoteTune offset=%.0f Hz", (double)off);
            } else {
                LOG_INF("  → Unhandled command: %s", cmnd);
            }
        }

        if (pub->message.topic.qos == MQTT_QOS_1_AT_LEAST_ONCE) {
            struct mqtt_puback_param ack = { .message_id = pub->message_id };
            mqtt_publish_qos1_ack(client, &ack);
        }
        break;
    }

    case MQTT_EVT_SUBACK:
        LOG_INF("MQTT SUBACK id=%u result=%d",
                evt->param.suback.message_id, evt->result);
        break;

    default:
        LOG_DBG("MQTT event: %d (connected %us)",
                evt->type,
                (unsigned)(now - mqtt_connected_uptime_ms) / 1000);
        break;
    }
}

