Bwooce/tinygs_nRF52/src/main.cpp
    /* USB is already enabled in main() before this function is called */
}

/* -------------------------------------------------------------------------- */
/* -------------------------------------------------------------------------- */
/* RadioLib — radio type selected by DTS compatible                             */
/* -------------------------------------------------------------------------- */

static ZephyrHal radio_hal(lora_spi.bus, (struct spi_config *)&lora_spi.config);
static Module *radio_mod = nullptr;
/* Radio type from DTS compatible — compile-time selection */
#define LORA_NODE DT_ALIAS(lora0)
#if DT_NODE_HAS_COMPAT(LORA_NODE, semtech_sx1262)
  SX1262 *radio = nullptr;
#elif DT_NODE_HAS_COMPAT(LORA_NODE, semtech_sx1268)
  SX1268 *radio = nullptr;
#elif DT_NODE_HAS_COMPAT(LORA_NODE, semtech_sx1276)
  SX1276 *radio = nullptr;
#elif DT_NODE_HAS_COMPAT(LORA_NODE, semtech_sx1278)
  SX1278 *radio = nullptr;
#else
  #error "Unsupported LoRa radio — check lora0 alias in app.overlay"
#endif

/* LoRa packet reception flag — set by DIO1 ISR */
/* lora_packet_received moved to top — see forward declaration */

/* -------------------------------------------------------------------------- */
/* SNTP Time Sync                                                              */
/* -------------------------------------------------------------------------- */

/* Offset in milliseconds — same unit as k_uptime_get(), so the common
 * case is one add. real_epoch_ms = k_uptime_get() + sntp_epoch_offset_ms.
 * Scale to seconds or microseconds only at the point of use. SNTP's aTime
 * is whole-second anyway, so storing in ms gives us all the precision we
 * can claim; storing in µs would just pad zeros on the low end. */
static int64_t sntp_epoch_offset_ms = 0;
static bool time_synced = false;

/* Signalled by sntp_response_handler so sntp_sync() can block the state
 * machine until we have a real epoch (or a hard timeout). Welcome payload
 * carries the `time` field, so we must sync *before* CONNACK. */
static K_SEM_DEFINE(sntp_sem, 0, 1);

int64_t get_utc_epoch_us(void)
{
    if (!time_synced) return 0;
    return (k_uptime_get() + sntp_epoch_offset_ms) * 1000LL;
}

int64_t get_utc_epoch(void)
{
    if (!time_synced) return 0;
    return (k_uptime_get() + sntp_epoch_offset_ms) / 1000LL;
}

/* SNTP callback — called from OpenThread context */
static void sntp_response_handler(void *aContext, uint64_t aTime, otError aResult)
{
    if (aResult == OT_ERROR_NONE) {
        sntp_epoch_offset_ms = (int64_t)aTime * 1000LL - k_uptime_get();
        time_synced = true;
        LOG_INF("SNTP: synced, epoch=%llu", (unsigned long long)aTime);
    } else {
        LOG_WRN("SNTP: failed (%d %s)", (int)aResult, otThreadErrorToString(aResult));
    }
    k_sem_give(&sntp_sem);
}

/**
 * Sync time via OpenThread SNTP client.
 * Uses Google NTP (2001:4860:4806:8::) — native IPv6, no NAT64 needed.
 */
static void sntp_sync(void)
{
    struct openthread_context *ot_ctx = openthread_get_default_context();
    if (!ot_ctx) return;

    /* Resolve TINYGS_SNTP_HOSTNAME through the same DNS path the MQTT
     * client uses. The resolver returns a NAT64-synthesised AAAA for the
     * IPv4 NTP server the pool picks today — so no hardcoded IPv4 to go
     * stale, and no extra failure mode (if DNS is broken, MQTT is broken
     * too and the station is already down). Cached statically: resolve
     * on first use, reuse for subsequent re-syncs. */
    static otIp6Address sntp_peer_addr;
    static bool sntp_peer_resolved = false;
    if (!sntp_peer_resolved) {
        if (resolve_ipv4_hostname(TINYGS_SNTP_HOSTNAME, &sntp_peer_addr) != 0) {
            LOG_WRN("SNTP: hostname resolution failed, skipping sync");
            return;
        }
        sntp_peer_resolved = true;
    }

    otMessageInfo msgInfo;
    memset(&msgInfo, 0, sizeof(msgInfo));
    msgInfo.mPeerAddr = sntp_peer_addr;
    msgInfo.mPeerPort = TINYGS_SNTP_SERVER_PORT;

    char sntp_str[OT_IP6_ADDRESS_STRING_SIZE];
    otIp6AddressToString(&msgInfo.mPeerAddr, sntp_str, sizeof(sntp_str));
    LOG_INF("SNTP: query to %s [%s]:%u",
            TINYGS_SNTP_HOSTNAME, sntp_str, (unsigned)msgInfo.mPeerPort);

    otSntpQuery query;
    query.mMessageInfo = &msgInfo;

    k_sem_reset(&sntp_sem);

    openthread_api_mutex_lock(ot_ctx);
    otError err = otSntpClientQuery(ot_ctx->instance, &query,
                                     sntp_response_handler, NULL);
    openthread_api_mutex_unlock(ot_ctx);

    if (err != OT_ERROR_NONE) {
        LOG_WRN("SNTP: query failed (%d %s)", (int)err, otThreadErrorToString(err));
        return;
    }

    /* Block the state machine until the callback fires or we hit the
     * timeout. Non-fatal on timeout: welcome still gets sent, just with
     * time=0. Server tolerates missing/zero time (it's an optional field). */
    if (k_sem_take(&sntp_sem, K_SECONDS(10)) != 0) {
        LOG_WRN("SNTP: response timeout, proceeding without synced time");
    }
}

/* Daily drift-correction. nRF52840 RC RTC is ~250 ppm = ~22 s/day, which
 * would visibly drift a stable connect over a few days. Runs on the system
 * workq so the 10 s blocking sntp_sync() doesn't stall the MQTT main loop.
 * Doesn't clear time_synced — old offset stays valid until the callback
 * atomically replaces it, so a failed periodic resync doesn't break the
 * station. Reschedules unconditionally: next attempt is always 24 h away. */
#define SNTP_RESYNC_INTERVAL  K_HOURS(24)
static void sntp_resync_work_handler(struct k_work *work);
static K_WORK_DELAYABLE_DEFINE(sntp_resync_work, sntp_resync_work_handler);

static void sntp_resync_work_handler(struct k_work *work)
{
    ARG_UNUSED(work);
    LOG_INF("SNTP: periodic drift-correction resync");
    sntp_sync();
    k_work_reschedule(&sntp_resync_work, SNTP_RESYNC_INTERVAL);
}

/* -------------------------------------------------------------------------- */
/* Doppler Compensation (P13 satellite propagator)                             */
/* -------------------------------------------------------------------------- */

