Bwooce/tinygs_nRF52/src/main.cpp
#include "AioP13.h"

static uint32_t last_doppler_ms = 0;

/**
 * Compute Doppler shift using P13 propagator and apply to radio frequency.
 * Called every 4 seconds from the main loop. Requires valid TLE and time.
 *
 * NOTE: This requires real UTC time which we don't have (no NTP over Thread).
 * Doppler activates automatically when begine includes TLE data and
 * incorrect results without accurate time. When TLE data arrives and we
 * implement time sync, this will produce real Doppler corrections.
 */
static void doppler_update(void)
{
    if (!tinygs_radio.tle_valid || !radio) {
        return;
    }

    /* SNTP time sync via OpenThread SNTP client → Google NTP IPv6 */
    if (!time_synced) {
        return; /* No SNTP time yet — can't predict orbits */
    }

    int64_t epoch = get_utc_epoch();
    /* Convert epoch to Y/M/D H:M:S */
    /* Simple conversion — good enough for satellite tracking */
    time_t t = (time_t)epoch;
    struct tm *utc = gmtime(&t);
    if (!utc) return;

    P13DateTime dt(utc->tm_year + 1900, utc->tm_mon + 1, utc->tm_mday,
                   utc->tm_hour, utc->tm_min, utc->tm_sec);
    P13Observer obs("GS", (double)tinygs_station_lat,
                    (double)tinygs_station_lon,
                    (double)tinygs_station_alt);
    P13Satellite_tGS sat(tinygs_radio.tle);

    sat.predict(dt);

    /* Get elevation and satellite map position */
    double elevation = 0.0, azimuth = 0.0;
    sat.elaz(obs, elevation, azimuth);

    /* Update satellite position for world map display (128x64 ESP32 coords) */
    double sat_lat = 0, sat_lon = 0;
    sat.latlon(sat_lat, sat_lon);
    tinygs_radio.sat_pos_x = (float)((180.0 + sat_lon) / 360.0 * 128.0);
    tinygs_radio.sat_pos_y = (float)((90.0 - sat_lat) / 180.0 * 64.0);

    if (elevation <= 0.0 || !tinygs_radio.doppler_enabled) {
        return; /* Below horizon or Doppler disabled (tlx) — position updated, no freq correction */
    }

    /* Compute Doppler — doppler() takes MHz, returns shifted MHz */
    double rx_freq_mhz = (double)tinygs_radio.frequency;
    double doppler_freq_mhz = sat.doppler(rx_freq_mhz, P13_FRX);
    float new_doppler = (float)((doppler_freq_mhz - rx_freq_mhz) * 1e6);

    /* Hysteresis — only retune if change exceeds tolerance */
    if (fabsf(new_doppler - tinygs_radio.freq_doppler) > tinygs_radio.doppler_tol) {
        tinygs_radio.freq_doppler = new_doppler;
        float effective_freq = tinygs_radio.frequency +
                              (tinygs_radio.freq_offset + tinygs_radio.freq_doppler) / 1e6f;
        radio->setFrequency(effective_freq);
        radio->startReceive();
        LOG_INF("Doppler: %.0f Hz → %.6f MHz (el=%.1f°)",
                (double)new_doppler, (double)effective_freq, elevation);
    }
}

/* -------------------------------------------------------------------------- */
/* LoRa RX                                                                     */
/* -------------------------------------------------------------------------- */

static void lora_rx_callback(void)
{
    lora_packet_received = true;
}

static void init_radio(void)
{
    LOG_INF("Initializing LoRa radio (%s)...", DT_NODE_FULL_NAME(LORA_NODE));

    uint32_t cs   = radio_hal.addPin(&lora_cs);
    uint32_t rst  = radio_hal.addPin(&lora_reset);
    uint32_t busy = radio_hal.addPin(&lora_busy);
    uint32_t dio1 = radio_hal.addPin(&lora_dio1);

    /* Run HAL smoke tests before radio init */
    /* HAL smoke tests disabled for production — saves ~1KB flash
     * extern int zephyr_hal_run_tests(ZephyrHal *hal);
     * zephyr_hal_run_tests(&radio_hal); */

    radio_mod = new Module(&radio_hal, cs, dio1, rst, busy);
#if DT_NODE_HAS_COMPAT(LORA_NODE, semtech_sx1262)
    radio = new SX1262(radio_mod);
#elif DT_NODE_HAS_COMPAT(LORA_NODE, semtech_sx1268)
    radio = new SX1268(radio_mod);
#elif DT_NODE_HAS_COMPAT(LORA_NODE, semtech_sx1276)
    radio = new SX1276(radio_mod);
#elif DT_NODE_HAS_COMPAT(LORA_NODE, semtech_sx1278)
    radio = new SX1278(radio_mod);
#endif

    /* T114 SX1262 uses TCXO on DIO3 at 1.8V — MUST be set or
     * the frequency reference is dead and all packets fail CRC */
    int state = radio->begin(TINYGS_DEFAULT_FREQ, 250.0, 10, 5, 0x12, 5, 8, 1.8);
    if (state == RADIOLIB_ERR_NONE) {
        LOG_INF("Radio: %s initialized (RadioLib)",
                DT_NODE_FULL_NAME(DT_NODELABEL(sx1262)));
    } else {
        LOG_ERR("Radio init failed: %d (%s)", state, radio_err_name(state));
        return;
    }

    /* begin() already set default params, just add boosted gain */
    radio->autoLDRO();
    radio->setRxBoostedGainMode(true);

    /* Register DIO1 interrupt callback and start receiving */
    radio->setPacketReceivedAction(lora_rx_callback);
    state = radio->startReceive();
    if (state == RADIOLIB_ERR_NONE) {
        LOG_INF("LoRa listening on %.3f MHz, SF%d, BW%.0f",
                (double)tinygs_radio.frequency, tinygs_radio.sf,
                (double)tinygs_radio.bw);
    } else {
        LOG_ERR("startReceive failed: %d (%s)", state, radio_err_name(state));
    }
}

/*
 * Apply the modem config persisted by the last beginp. Called after
 * init_radio() — overrides the hardcoded defaults when NVS has a saved
 * blob. Subset of the full begine handler: applies the core radio
 * settings (mode/freq/bw/sf/cr/sw/pl/iIQ for LoRa; freq/br/fd/bw/pl/sync
 * for FSK). The server will send a fresh `begine` on next connect which
 * will fully reconfigure including filter + TLE, so we don't duplicate
 * that logic here.
 */
static void apply_saved_modem_conf(void)
{
    if (!radio) return;
    char *conf = tinygs_radio.modem_conf;
    if (!conf || conf[0] == '\0' || strcmp(conf, "{}") == 0) {
        LOG_INF("No saved modem_conf — using defaults");
        return;
    }

    /* tinygs_parse_begine modifies the buffer in place (strtok-style) — we
     * only want to inspect what we saved, not mangle it. Parse a copy. */
    static char scratch[sizeof(tinygs_radio.modem_conf)];
    size_t n = strlen(conf);
    memcpy(scratch, conf, n + 1);

    struct tinygs_begine_msg msg;
    int64_t rc = tinygs_parse_begine(scratch, n, &msg);
    if (rc < 0 || !msg.mode) {
        LOG_WRN("Saved modem_conf unparsable — using defaults");
        return;
    }

    bool is_fsk = (strcmp(msg.mode, "FSK") == 0);
    float freq = tinygs_begine_get_freq(&msg);
    float bw   = tinygs_begine_get_bw(&msg);
    if (is_fsk) {
        float br = tinygs_begine_get_br(&msg);
        float fd = tinygs_begine_get_fd(&msg);
        int16_t src = radio->beginFSK(freq, br, fd, bw,
                                      msg.pwr, msg.pl, 1.8f);
        if (src == RADIOLIB_ERR_NONE) {
            tinygs_radio.frequency   = freq;
            tinygs_radio.bw          = bw;
            tinygs_radio.bitrate     = br;
            tinygs_radio.freq_dev    = fd;
            strncpy(tinygs_radio.modem_mode, "FSK",
                    sizeof(tinygs_radio.modem_mode));
            LOG_INF("Applied saved modem_conf: FSK %.4f MHz br=%.3f fd=%.3f bw=%.1f",
                    (double)freq, (double)br, (double)fd, (double)bw);
        } else {
            LOG_WRN("Saved FSK config rejected (%d), using defaults", src);
        }
    } else {
        int16_t src = radio->begin(freq, bw, msg.sf, msg.cr,
                                   msg.sw, msg.pwr, msg.pl, 1.8f);
        if (src == RADIOLIB_ERR_NONE) {
            radio->invertIQ(msg.iIQ);
            tinygs_radio.frequency = freq;
            tinygs_radio.bw        = bw;
            tinygs_radio.sf        = msg.sf;
            tinygs_radio.cr        = msg.cr;
            tinygs_radio.iIQ       = msg.iIQ;
            strncpy(tinygs_radio.modem_mode, "LoRa",
                    sizeof(tinygs_radio.modem_mode));
            LOG_INF("Applied saved modem_conf: LoRa %.4f MHz SF%d CR%d BW%.1f",
                    (double)freq, msg.sf, msg.cr, (double)bw);
        } else {
            LOG_WRN("Saved LoRa config rejected (%d), using defaults", src);
        }
    }
    /* Satellite name + NORAD for welcome/status continuity */
    if (msg.sat) {
        strncpy(tinygs_radio.satellite, msg.sat,
                sizeof(tinygs_radio.satellite) - 1);
        tinygs_radio.satellite[sizeof(tinygs_radio.satellite) - 1] = '\0';
    }
    tinygs_radio.norad = (uint32_t)msg.NORAD;
    radio->startReceive();
}

