Bwooce/tinygs_nRF52/src/main.cpp
/*
 * Check for received LoRa packets and process them.
 * Called from the main loop. Returns true if a packet was processed.
 */
static bool lora_check_rx(void)
{
    if (!lora_packet_received || radio == nullptr) {
        return false;
    }

    lora_packet_received = false;

    size_t len = radio->getPacketLength();
    if (len == 0 || len > 255) {
        radio->startReceive();
        return false;
    }

    uint8_t data[256];
    int state = radio->readData(data, len);

    float rssi = radio->getRSSI();
    float snr = radio->getSNR();
    float freq_err = radio->getFrequencyError();

    /* Store last-packet metrics for status payload */
    tinygs_radio.last_rssi = rssi;
    tinygs_radio.last_snr = snr;
    tinygs_radio.last_freq_err = freq_err;
    tinygs_radio.last_crc_error = (state == RADIOLIB_ERR_CRC_MISMATCH);

    if (state == RADIOLIB_ERR_NONE) {
        lora_rx_count++;
        /* Flash LED1 white on packet RX */
        neopixel_set(NEO_OFF,  NEO_WHITE); /* LED1 flash on LoRa RX */
        LOG_INF("LoRa RX: %u bytes, RSSI=%.1f, SNR=%.1f, FreqErr=%.1f",
                (unsigned)len, (double)rssi, (double)snr, (double)freq_err);

        /* FSK framing post-processing (AX.25, PN9 descramble).
         * Applied before filter and CRC checks, matching ESP32 order. */
        bool frame_error = false;
        if (strcmp(tinygs_radio.modem_mode, "FSK") == 0) {
            if (tinygs_radio.fsk_framing == 1 || tinygs_radio.fsk_framing == 3) {
                /* AX.25 NRZS decode (framing=1) or scrambled AX.25 (framing=3) */
                /* Need FSK sync word from radio state for prepending */
                uint8_t fsw_buf[8];
                int fsw_len = tinygs_parse_fsw(
                    tinygs_radio.modem_conf, strlen(tinygs_radio.modem_conf),
                    fsw_buf, sizeof(fsw_buf));

                /* TODO(tests): temporary diagnostic — logs the raw pre-decode
                 * FSK bytes alongside the decoded AX.25 frame so we can build
                 * a unit test for bitcode_nrz2ax25 the next time a real packet
                 * lands (SAMSAT, Colibri-S, Norby-2 etc.). Remove once a
                 * regression test exists in tests/json_parser. */
                LOG_HEXDUMP_INF(data, (len < 64 ? len : 64),
                                "AX.25 pre-decode raw FSK bytes");
                LOG_INF("AX.25 pre-decode: len=%u, fsw_len=%d, framing=%d",
                        (unsigned)len, fsw_len, tinygs_radio.fsk_framing);

                uint8_t ax25[256];
                size_t ax25_len = 0;
                int rc = bitcode_nrz2ax25(data, len, fsw_buf, fsw_len,
                                          tinygs_radio.fsk_framing,
                                          ax25, &ax25_len, sizeof(ax25));
                if (rc == 0 && ax25_len > 0) {
                    memcpy(data, ax25, ax25_len);
                    len = ax25_len;
                    LOG_INF("AX.25 decoded: %u bytes", (unsigned)len);
                } else {
                    frame_error = true;
                    LOG_WRN("AX.25 frame error");
                }
            } else if (tinygs_radio.fsk_framing == 2) {
                /* PN9 descramble */
                uint8_t descrambled[256];
                bitcode_pn9(data, len, descrambled);
                memcpy(data, descrambled, len);
            }
        }

        /* Apply packet filter if active.
         * filter[0] = count of bytes to match
         * filter[1] = byte position in packet to start matching
         * filter[2..N] = expected byte values */
        if (tinygs_radio.filter[0] > 0) {
            uint8_t count = tinygs_radio.filter[0];
            uint8_t start = tinygs_radio.filter[1];
            bool filtered = false;
            for (uint8_t i = 0; i < count && i + 2 < sizeof(tinygs_radio.filter); i++) {
                if (start + i >= len || data[start + i] != tinygs_radio.filter[2 + i]) {
                    filtered = true;
                    break;
                }
            }
            if (filtered) {
                LOG_DBG("LoRa RX: filtered out (no match at offset %d)", start);
                radio->startReceive();
                return true;
            }
        }

        /* Software CRC check (FSK mode with cSw enabled).
         * The last crc_bytes of the packet contain the CRC.
         * Matches ESP32 Radio.cpp line 631-677 logic. */
        bool sw_crc_fail = false;
        if (tinygs_radio.sw_crc_enabled && tinygs_radio.sw_crc_bytes > 0 &&
            len > tinygs_radio.sw_crc_bytes) {
            size_t data_len = len - tinygs_radio.sw_crc_bytes;
            uint16_t crc = tinygs_radio.sw_crc_init;
            uint16_t poly = tinygs_radio.sw_crc_poly;
            for (size_t i = 0; i < data_len; i++) {
                uint8_t b = tinygs_radio.sw_crc_refin ?
                    __RBIT((uint32_t)data[i]) >> 24 : data[i];
                if (tinygs_radio.sw_crc_bytes == 2) {
                    crc ^= (uint16_t)b << 8;
                    for (int j = 0; j < 8; j++) {
                        crc = (crc & 0x8000) ? (crc << 1) ^ poly : crc << 1;
                    }
                } else {
                    crc ^= b;
                    for (int j = 0; j < 8; j++) {
                        crc = (crc & 0x80) ? (crc << 1) ^ poly : crc << 1;
                    }
                }
            }
            crc ^= tinygs_radio.sw_crc_xor;
            if (tinygs_radio.sw_crc_refout) {
                crc = (uint16_t)(__RBIT((uint32_t)crc) >> (32 - tinygs_radio.sw_crc_bytes * 8));
            }
            crc &= (tinygs_radio.sw_crc_bytes == 1) ? 0xFF : 0xFFFF;

            /* Extract CRC from packet tail */
            uint16_t pkt_crc;
            if (tinygs_radio.sw_crc_refin) {
                uint8_t b0 = __RBIT((uint32_t)data[len - 2]) >> 24;
                uint8_t b1 = __RBIT((uint32_t)data[len - 1]) >> 24;
                pkt_crc = (uint16_t)b0 << 8 | b1;
            } else {
                pkt_crc = (uint16_t)data[len - 2] << 8 | data[len - 1];
            }

            if (crc != pkt_crc) {
                sw_crc_fail = true;
                LOG_WRN("FSK SW CRC fail: calc=%04x pkt=%04x", crc, pkt_crc);
            }
        }

        /* Notify display of packet reception */
        tinygs_display_packet_rx(rssi, snr);

        /* Publish via MQTT if connected */
        if (app_state == STATE_MQTT_CONNECTED) {
            if (frame_error) {
                static const uint8_t err_frame[] = "Frame error!";
                tinygs_send_rx(&mqtt_client, cfg_mqtt_user, cfg_station,
                               err_frame, sizeof(err_frame) - 1, rssi, snr, freq_err, true);
            } else if (sw_crc_fail) {
                static const uint8_t err_crc[] = "Error_CRC";
                tinygs_send_rx(&mqtt_client, cfg_mqtt_user, cfg_station,
                               err_crc, sizeof(err_crc) - 1, rssi, snr, freq_err, true);
            } else {
                tinygs_send_rx(&mqtt_client, cfg_mqtt_user, cfg_station,
                               data, len, rssi, snr, freq_err, false);
            }
        }
    } else if (state == RADIOLIB_ERR_CRC_MISMATCH) {
        LOG_WRN("LoRa RX: CRC error, %u bytes, RSSI=%.1f, SNR=%.1f, FreqErr=%.1f",
                (unsigned)len, (double)rssi, (double)snr, (double)freq_err);
        /* Dump first 16 bytes for diagnosis */
        LOG_HEXDUMP_DBG(data, len < 16 ? len : 16, "CRC err data");

        /* Send CRC error packets to server like ESP32 does.
         * With filter active (filter[0] != 0), ESP32 drops CRC errors.
         * With no filter, it sends "Error_CRC" as the payload. */
        if (tinygs_radio.filter[0] == 0 && app_state == STATE_MQTT_CONNECTED) {
            static const uint8_t err_crc[] = "Error_CRC";
            tinygs_send_rx(&mqtt_client, cfg_mqtt_user, cfg_station,
                           err_crc, sizeof(err_crc) - 1, rssi, snr, freq_err, true);
        }
    } else {
        LOG_ERR("LoRa readData failed: %d (%s)", state, radio_err_name(state));
    }

    /* Restart reception, turn off RX flash */
    radio->startReceive();
    neopixel_off(); /* Back to off after RX flash */
    return true;
}

