Bwooce/tinygs_nRF52/src/main.cpp
/* -------------------------------------------------------------------------- */
/* Main                                                                        */
/* -------------------------------------------------------------------------- */

int main(void)
{
    const struct device *const console_dev = DEVICE_DT_GET(DT_CHOSEN(zephyr_console));
    uint32_t dtr = 0;

    if (device_is_ready(console_dev)) {
        cdc_acm_dte_rate_callback_set(console_dev, baudrate_reset_handler);
    }

    enable_peripherals();

    /* FATFS operations BEFORE USB enable — mount, write, read, unmount.
     * Must complete before USB MSC goes live to avoid concurrent access. */
    setup_usb_storage();

    /* Enable USB composite (CDC ACM console + MSC drive) */
    if (usb_enable(NULL) == 0) {
        LOG_INF("USB active (MSC + CDC ACM)");
    }

    /* Wait briefly for serial monitor to connect */
    for (int i = 0; i < 30 && !dtr; i++) {
        uart_line_ctrl_get(console_dev, UART_LINE_CTRL_DTR, &dtr);
        k_msleep(100);
    }

    LOG_INF("=== TinyGS nRF52 v%u — Thread/MQTT-TLS ===", (unsigned)TINYGS_VERSION);

    /* Log boot/reset reason — read raw nRF RESETREAS for full picture.
     * Errata 136: after pin reset, other bits may be falsely set. */
    {
        uint32_t resetreas = NRF_POWER->RESETREAS;
        NRF_POWER->RESETREAS = resetreas; /* Clear by writing 1s */
        uint32_t gpregret = nrf_power_gpregret_get(NRF_POWER, 0);

        LOG_INF("Boot: RESETREAS=0x%08x gpregret=0x%02x [%s%s%s%s%s%s]",
                resetreas, gpregret,
                (resetreas & (1<<0)) ? "PIN " : "",
                (resetreas & (1<<1)) ? "DOG " : "",
                (resetreas & (1<<2)) ? "SREQ " : "",
                (resetreas & (1<<3)) ? "LOCKUP " : "",
                (resetreas & (1<<16)) ? "OFF " : "",
                (resetreas & (1<<17)) ? "DIF " : "");

        if (gpregret == 0x57) {
            LOG_INF("  → 1200-baud bootloader entry");
        }
        if (resetreas & (1<<3)) {
            LOG_ERR("  → CPU LOCKUP detected! (fault-in-fault-handler)");
        }
    }

    /* Check for crash diagnostic from previous boot (retained RAM) */
    if ((crash_reason & 0xFFFF0000) == CRASH_MAGIC) {
        uint32_t vectactive = crash_icsr & 0x1FF;
        int irq_num = (int)vectactive - 16;
        unsigned r = crash_reason & 0xFFFF;
        static const char *reason_names[] = {
            "CPU_EXCEPTION", "SPURIOUS_IRQ", "STACK_CHK_FAIL",
            "KERNEL_OOPS",   "KERNEL_PANIC"
        };
        const char *reason_str = (r < ARRAY_SIZE(reason_names)) ? reason_names[r] : "ARCH_SPECIFIC";
        /* nRF52840 external IRQ number → peripheral name */
        static const char *irq_names[] = {
            "POWER_CLOCK","RADIO","UARTE0","SPI0","SPI1","NFCT","GPIOTE","SAADC",
            "TIMER0","TIMER1","TIMER2","RTC0","TEMP","RNG","ECB","CCM_AAR",
            "WDT","RTC1","QDEC","COMP","SWI0","SWI1","SWI2","SWI3","SWI4","SWI5",
            "TIMER3","TIMER4","PWM0","PDM","res30","res31","MWU","PWM1","PWM2",
            "SPI2","RTC2","I2S","FPU","USBD","UARTE1","QSPI","CRYPTOCELL"
        };
        const char *irq_str = (irq_num >= 0 && irq_num < (int)ARRAY_SIZE(irq_names))
                               ? irq_names[irq_num] : "?";
        LOG_ERR("*** PREVIOUS CRASH: thread='%s' reason=%u(%s) PC=0x%08x LR=0x%08x ICSR=0x%08x IRQ=%d(%s) ***",
                crash_thread[0] ? crash_thread : "?",
                r, reason_str,
                (unsigned)crash_pc, (unsigned)crash_lr,
                (unsigned)crash_icsr, irq_num, irq_str);
        LOG_ERR("Use: arm-zephyr-eabi-addr2line -e build/zephyr/zephyr.elf 0x%08x",
                (unsigned)crash_pc);
        crash_reason = 0; /* Clear so we don't report again */
    }

    log_heap_usage("boot");
    init_openthread();

#if defined(CONFIG_IOT_LOG)
    {
        iot_log_config_t log_cfg = IOT_LOG_CONFIG_DEFAULT();
        log_cfg.device_name = "TinyGS-nRF52";
        log_cfg.level = IOT_LOG_DEBUG;
        log_cfg.always_on = false;
        iot_log_init(&log_cfg);
    }
#endif

    /* Check if device has Thread credentials (commissioned).
     * If not, stay fully awake for 15 minutes to allow Joiner commissioning.
     * The user needs time to scan the QR code from index.html. */
    {
        struct openthread_context *ot_ctx = openthread_get_default_context();
        if (ot_ctx) {
            openthread_api_mutex_lock(ot_ctx);
            bool commissioned = otDatasetIsCommissioned(ot_ctx->instance);
            openthread_api_mutex_unlock(ot_ctx);

            if (!commissioned) {
                LOG_INF("*** COMMISSIONING MODE ***");
                LOG_INF("Device not provisioned — staying awake for 15 minutes");
                LOG_INF("Joiner PSKd: %s", CONFIG_OPENTHREAD_JOINER_PSKD);
                LOG_INF("Scan QR code from index.html or run:");
                LOG_INF("  ot-ctl commissioner joiner add '*' %s",
                        CONFIG_OPENTHREAD_JOINER_PSKD);
                /* Keep display on during commissioning */
                tinygs_display_set_timeout(900); /* 15 minutes */
            } else {
                LOG_INF("Thread credentials found — normal mode");
            }
        }
    }

    /* Load persistent config from NVS. Must be AFTER init_openthread()
     * because OpenThread initializes the settings/NVS subsystem.
     * No extra CONFIG_SETTINGS needed in prj.conf — OpenThread provides it.
     * config.json values are loaded first (in setup_usb_storage), then
     * NVS overrides with any previously saved values. */
    tinygs_config_init();
    tinygs_display_init();
    watchdog_init();
    led_init();
    breathing_led_init();
    init_radio();
    apply_saved_modem_conf();

    int retry_count = 0;
    int mqtt_poll_fd_count = 0;
    struct zsock_pollfd mqtt_poll_fd;

    while (1) {
        switch (app_state) {

        case STATE_WAIT_THREAD:
            /* Blue blink while waiting for Thread */
            neopixel_set(0, 0, (k_uptime_get_32() / 500) % 2 ? 20 : 0,  NEO_OFF); /* Blue blink = waiting for Thread */
            if (thread_attached) {
                /* Heap stats now in periodic STATUS log */
                LOG_INF("--- Thread attached, waiting 5s for routing to stabilize ---");
                k_msleep(5000);
#if defined(CONFIG_IOT_LOG)
                /* Trigger deferred multicast join now that Thread is attached */
                iot_log_poll();
#endif
                app_state = STATE_DNS_RESOLVE;
                retry_count = 0;
            } else {
                LOG_INF("Waiting for Thread network... (%ds)", retry_count * 10);
                log_ot_diagnostics();
                retry_count++;
                k_msleep(10000);
            }
            break;

