Bwooce/tinygs_nRF52/src/main.cpp
        case STATE_DNS_RESOLVE:
            /* Heap stats now in periodic STATUS log */
            log_ot_diagnostics();
            if (resolve_broker() == 0) {
                /* Sync time before MQTT connect so the welcome payload
                 * carries a valid `time` field. Non-fatal: if SNTP fails
                 * we connect anyway and welcome just omits the time.
                 * Reconnects skip this — they reuse the cached offset so
                 * MQTT comes back fast. Drift correction is handled
                 * out-of-band by sntp_resync_work. */
                if (!time_synced) {
                    sntp_sync();
                    /* Kick off periodic drift-correction regardless of
                     * boot-sync success — if boot failed, tomorrow's
                     * attempt might succeed. */
                    k_work_reschedule(&sntp_resync_work, SNTP_RESYNC_INTERVAL);
                }
                app_state = STATE_MQTT_CONNECT;
            } else {
                retry_count++;
                if (retry_count > 10) {
                    LOG_ERR("DNS failed after %d attempts", retry_count);
                    app_state = STATE_ERROR;
                } else {
                    LOG_WRN("DNS retry %d/10 in 5s...", retry_count);
                    k_msleep(5000);
                }
            }
            break;

        case STATE_MQTT_CONNECT:
            /* Heap stats now in periodic STATUS log */
            if (mqtt_tls_connect() == 0) {
                /* Set up poll fd for mqtt_input */
                mqtt_poll_fd.fd = mqtt_client.transport.tls.sock;
                mqtt_poll_fd.events = ZSOCK_POLLIN;
                mqtt_poll_fd_count = 1;

                /* Process until CONNACK or timeout */
                int wait_ms = 15000; /* 15s for TLS handshake + CONNACK */
                while (app_state == STATE_MQTT_CONNECT && wait_ms > 0) {
                    int rc = zsock_poll(&mqtt_poll_fd, mqtt_poll_fd_count, 1000);
                    if (rc > 0) {
                        mqtt_input(&mqtt_client);
                    }
                    mqtt_live(&mqtt_client);
                    wait_ms -= 1000;
                }
                if (app_state == STATE_MQTT_CONNECT) {
                    LOG_ERR("MQTT connect timeout (no CONNACK in 15s)");
                    mqtt_disconnect(&mqtt_client);
                    app_state = STATE_ERROR;
                }
            } else {
                app_state = STATE_ERROR;
            }
            break;

        case STATE_MQTT_CONNECTED: {
            LOG_INF("MQTT connected, entering main loop");
            neopixel_off(); /* NeoPixels off when stable */
            breathing_led_start(); /* Green LED breathes when connected */

            /* Time sync happens pre-connect so welcome carries a valid
             * `time` field (see STATE_DNS_RESOLVE). */

            /* TinyGS main loop — process MQTT, LoRa RX, and pings */
            uint32_t last_ping_ms = k_uptime_get_32();
            uint32_t last_status_log_ms = last_ping_ms;
            #define STATUS_LOG_INTERVAL_MS 300000 /* 5 minutes */

            while (app_state == STATE_MQTT_CONNECTED) {
                /* Poll MQTT socket for incoming data */
                int rc = zsock_poll(&mqtt_poll_fd, mqtt_poll_fd_count, 100);
                if (rc > 0) {
                    mqtt_input(&mqtt_client);
                }
                {
                    int live_ret = mqtt_live(&mqtt_client);
                    if (live_ret && live_ret != -EAGAIN) {
                        LOG_DBG("mqtt_live: %d (%s)", live_ret, errno_name(live_ret));
                    }
                    /* Zephyr mqtt_client doesn't auto-disconnect on missed
                     * PINGRESPs — it just increments unacked_ping forever.
                     * Force a clean reconnect after 2 missed responses so
                     * the server drops our stale session rather than
                     * waiting for the 600 s watchdog (which we saw fire
                     * 4× overnight from NAT64 idle hangs).
                     * PubSubClient on ESP32 does this for free. */
                    if (mqtt_client.unacked_ping >= TINYGS_MQTT_UNACKED_PING_MAX) {
                        LOG_WRN("MQTT: %d unacked PINGREQs — forcing reconnect",
                                mqtt_client.unacked_ping);
                        mqtt_disconnect(&mqtt_client);
                        app_state = STATE_MQTT_CONNECT;
                        break;
                    }
                }

                /* Check for LoRa packet reception */
                lora_check_rx();

                /* Update display (~every 100ms from poll timeout) */
                tinygs_display_update();

#if defined(CONFIG_IOT_LOG)
                /* Check for remote log listener beacons */
                iot_log_poll();
#endif

                /* Doppler compensation — every 4s if TLE available */
                uint32_t now_ms = k_uptime_get_32();
                if ((now_ms - last_doppler_ms) >= doppler_interval_ms) {
                    doppler_update();
                    last_doppler_ms = now_ms;
                }

                /* Send TinyGS ping (also serves as MQTT keepalive — see protocol doc) */
                if ((now_ms - last_ping_ms) >= (TINYGS_PING_INTERVAL_S * 1000)) {
                    tinygs_send_ping(&mqtt_client, cfg_mqtt_user, cfg_station);
                    last_ping_ms = now_ms;
                }

                /* Weblogin request via BOOT button */
                if (tinygs_display_weblogin_requested()) {
                    tinygs_send_weblogin_request(&mqtt_client, cfg_mqtt_user, cfg_station);
                }

                /* Track main thread stack high-water mark */
#if defined(CONFIG_INIT_STACKS) && defined(CONFIG_THREAD_STACK_INFO)
                {
                    static size_t stack_hwm = SIZE_MAX;
                    size_t unused = 0;
                    if (k_thread_stack_space_get(k_current_get(), &unused) == 0) {
                        if (unused < stack_hwm) stack_hwm = unused;
                    }
                }
#endif

                /* Periodic status log — every 5 minutes */
                if ((now_ms - last_status_log_ms) >= STATUS_LOG_INTERVAL_MS) {
                    uint32_t uptime_s = k_uptime_get_32() / 1000;
                    uint32_t conn_s = (now_ms - mqtt_connected_uptime_ms) / 1000;

                    /* Get main thread stack usage */
                    size_t stack_unused = 0;
                    size_t stack_size = CONFIG_MAIN_STACK_SIZE;
#if defined(CONFIG_INIT_STACKS) && defined(CONFIG_THREAD_STACK_INFO)
                    k_thread_stack_space_get(k_current_get(), &stack_unused);
#endif
                    size_t stack_used = stack_size - stack_unused;

