Bwooce/tinygs_nRF52/src/main.cpp
#ifdef CONFIG_SYS_HEAP_RUNTIME_STATS
                    struct sys_memory_stats stats;
                    sys_heap_runtime_stats_get(&_system_heap.heap, &stats);
                    LOG_INF("STATUS: up=%us conn=%us mqtt_rx=%u lora_rx=%u "
                            "heap=%u/%u(peak=%u) stack=%u/%u "
                            "vbat=%dmV sat=%s",
                            (unsigned)uptime_s, (unsigned)conn_s,
                            (unsigned)mqtt_rx_count, (unsigned)lora_rx_count,
                            (unsigned)stats.allocated_bytes,
                            (unsigned)CONFIG_HEAP_MEM_POOL_SIZE,
                            (unsigned)stats.max_allocated_bytes,
                            (unsigned)stack_used, (unsigned)stack_size,
                            read_vbat_mv(),
                            tinygs_radio.satellite);
#else
                    LOG_INF("STATUS: up=%us conn=%us mqtt_rx=%u lora_rx=%u "
                            "stack=%u/%u vbat=%dmV sat=%s",
                            (unsigned)uptime_s, (unsigned)conn_s,
                            (unsigned)mqtt_rx_count, (unsigned)lora_rx_count,
                            (unsigned)stack_used, (unsigned)stack_size,
                            read_vbat_mv(),
                            tinygs_radio.satellite);
#endif
                    last_status_log_ms = now_ms;
                }

                k_msleep(100);  /* 100ms loop — responsive to LoRa packets */
            }
            break;
        }

        case STATE_ERROR:
            neopixel_set(NEO_RED,  NEO_OFF); /* Red = error */
            breathing_led_stop();
            led_set(false);
            LOG_ERR("Error state. Retrying in 30s...");
            k_msleep(30000);
            app_state = thread_attached ? STATE_DNS_RESOLVE : STATE_WAIT_THREAD;
            retry_count = 0;
            break;
        }
    }

    return 0;
}
